Revit 2027 API
BoundarySegment.LinkElementId Property
 Retrieve the element id of the element in a link instance that forms this boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkElementId { get; }
Public ReadOnly Property LinkElementId As ElementId
	Get
public:
property ElementId^ LinkElementId {
	ElementId^ get ();
}
member LinkElementId : ElementId with get
Property Value
ElementId
See Also
Reference
BoundarySegment Class
Autodesk.Revit.DB Namespace